Repository: voikko/tmispell
Catalog: doc/sgml/*.po
Languages: fi

source: august 26, 2002
fi: 26. elokuuta 2002

source: An Ispell compatible front end for the spell checking module Soikko.
fi: Ispell-yhteensopiva käyttöliittymä Soikko-oikolukumoduulille.

source: configfile
fi: asetustiedosto

source: Ispell options
fi: Ispell-valitsimet

source: files
fi: tiedostot

source: DESCRIPTION
fi: KUVAUS

source: Tmispell is an Ispell compatible front-end for spell checking modules. To do the actual spell checking, for Finnish it uses the high-quality spell checking module %1$s, which is made by Pasi Ryhänen.
fi: Tmispell on Ispell-yhteensopiva käyttöliittymä oikolukumoduuleille. Varsinaisen oikoluvun suomea varten hoitaa korkealaatuinen oikolukumoduuli %1$s, jonka on tehnyt Pasi Ryhänen.

source: What makes Tmispell quite useful is that many programs (e.g. mail clients and document processors) use Ispell for spell checking. Since Tmispell is compatible with Ispell, these programs can use it without any changes needed.
fi: Tmispell on hyödyllinen, koska monet ohjelmat (esim. postiohjelmat sekä tekstinkäsittelyohjelmat) käyttävät Ispelliä oikolukemiseen. Koska Tmispell on myös Ispell-yhteensopiva, nämä ohjelmat voivat käyttää sitä ilman että mitään tarvitsee muuttaa.

source: Additionally Tmispell can launch Ispell if there is no module for the selected language. Thus it can be used as a drop-in replacement for Ispell.
fi: Lisäksi Tmispell osaa käynnistää alkuperäisen Ispellin, kun jollekin kielelle ei ole moduulia. Tämän vuoksi Tmispell sopii sellaisenaan Ispellin korvikkeeksi.

source: OPTIONS
fi: VALITSIMET

source: Tmispell understands the following options:
fi: Tmispell ymmärtää seuraavat valitsimet:

source: Read the configuration file %1$s instead of the default configuration file %2$s.
fi: Lue asetustiedosto %1$s oletusarvoisen tiedoston %2$s sijaan.

source: Tmispell should understand all options that Ispell does. For more information about them, see ispell(1).
fi: Tmispellin pitäisi ymmärtää kaikki Ispellin ymmärtämät valitsimet. Lisätietoja saa manuaalisivulta ispell(1).

source: FILES
fi: TIEDOSTOT

source: The configuration file for Tmispell.
fi: Tmispellin asetustiedosto.

source: The configuration file contains spell checker entries and options. &quot;#&quot; is a comment character: everything on a line after it is ignored.
fi: Asetustiedosto sisältää oikolukumoduulimerkintöjä sekä asetuksia. &quot;#&quot; on kommenttimerkki: kaikki teksti rivillä sen jälkeen jää huomiotta.

source: Syntax for options is simple: %1$s Note that the value string, if enclosed between quotes, may span multiple lines.
fi: Asetusten muoto on yksinkertainen: %1$s Huomaa, että arvomerkkijono voi olla usean rivin mittainen, jos se on lainausmerkkien välissä.

source: key
fi: avain

source: value
fi: arvo

source: Currently the options are: %1$s
fi: Mahdolliset asetukset ovat: %1$s

source: The location of the real Ispell executable to be called as a fall-back. Note that the full path to the program should be given. This option must always be specified.
fi: Varalla käytettävän oikean Ispell-ohjelmatiedoston sijainti. Huomaa, että koko polku tiedostoon täytyy antaa. Tämä asetus täytyy aina määritellä.

source: A list of TeX commands and their parameter lists to use when filtering TeX input. The syntax is &quot;%1$s %2$s, ...&quot;, where &quot;oOpP&quot; is a string of characters denoting the type of command's parameters. Uppercase letter means that a parameter should be spell checked, lowercase that it should not. 'O' and 'o' denote optional parameters, 'P' and 'p' normal parameters.
fi: Luettelo TeX-komennoista ja parametreista, joita TeX-suodatin käsittelee erityisesti. Syntaksi on &quot;%1$s %2$s, ...&quot;, jossa &quot;oOpP&quot; on merkkijono, jonka merkit tarkoittavat komennon erityyppisiä parametreja. Iso kirjain tarkoittaa, että parametri tulisi oikolukea, ja pieni, että sitä ei tulisi oikolukea. &quot;O&quot; ja &quot;o&quot; merkitsevät valinnaista ja &quot;P&quot; ja &quot;p&quot; tavallista (pakollista) parametria.

source: cmdname
fi: komento

source: A list of environments to skip when filtering TeX input.
fi: Luettelo ympäristöistä, joiden oikoluvun TeX-suodatin estää.

source: A list of SGML or HTML tag attributes to spell check.
fi: Luettelo SGML- tai HTML-määreistä, jotka tulisi oikolukea.

source: A dictionary specification consists of 7 strings on the same line, separated by whitespace and possibly enclosed in double or single quotes. Backslashes can be used to quote characters inside the quotes. The meanings of the strings are: %1$s
fi: Sanastomääritelmässä on 7 merkkijonoa samalla rivillä välein eroteltuina, ja tarvittaessa lainausmerkeissä. Kenoviivaa voi käyttää merkkien suojaamiseen lainausmerkkien sisällä. Merkkijonojen merkitykset ovat: %1$s

source: The name by which the dictionary is known, similar to the name of an Ispell hash file name without the extension &quot;.hash&quot;. This must be specified.
fi: Nimi, jolla sanasto tunnetaan; vastaa Ispellin hash-tiedoston nimeä ilman &quot;.hash&quot;-päätettä. Pakollinen.

source: The file name of the library file to load. This must be specified.
fi: Ladattavan kirjastotiedoston nimi. Pakollinen.

source: The file name of the dictionary file that the library uses. This must be specified.
fi: Kirjastotiedoston käyttämä sanasto. Pakollinen.

source: The input encoding this module uses. E.g. latin9. This must be specified.
fi: Moduulin syötteen merkistö, esimerkiksi latin9. Pakollinen.

source: The value of the locale variable %1$s that should be used with this module. This determines the default set of characters that are considered to belong to a word. If empty or not given, the value of a suitable environment variable is used.
fi: Maa-asetustomuuttujan %1$s arvo, jota käytetään tämän moduulin kanssa. Se määrittelee oletusarvoisesti merkit, jotka kuuluvat sanoihin. Jos tyhjä tai puuttuu, niin sopivan ympäristömuuttujan arvo on käytössä.

source: The set of additional word characters not specified by the locale. If not given, no additional word characters are assumed.
fi: Joukko lisämerkkejä, jotka voivat kuulua sanoihin. Jos tyhjä tai puuttuu, niin vain maa-asetuston määrittelemät merkit kuuluvat sanoihin.

source: The set of word boundary characters. They are considered to be a part of a word only when occurring inside one. If not given, no boundary characters are assumed.
fi: Välimerkit. Nämä merkit kuuluvat sanaan, vain jos ovat sen sisällä. Jos tyhjä tai puuttuu, välimerkkejä ei oleteta.

source: EXAMPLES
fi: ESIMERKIT

source: A configuration file example
fi: Asetustiedostoesimerkki

source: The first line of the configuration file just specifies the location of the fallback ispell program to use
fi: Asetustiedoston ensimmäinen rivi määrittelee tässä varalla olevan ispell-ohjelman.

source: The second line adds a module for Finnish, identified by the name &quot;suomi&quot;, which uses the given library file associated with a dictionary file. The input encoding to use is iso-8859-15 %1$s &quot;latin9&quot;. Only the letters specified by the locale &quot;fi_FI@euro&quot; and period are considered as word characters, and the boundary characters are &quot;-&quot;, &quot;'&quot; and &quot;:&quot;.
fi: Toinen rivi lisää suomea varten moduulin, jonka tunnisteeksi tulee &quot;suomi&quot; ja joka käyttää annettua kirjastotiedostoa annetun sanastotiedoston kanssa. Syötteen merkistö on iso-8859-15 %1$s &quot;latin9&quot;. Vain maa-asetuston &quot;fi_FI@euro&quot; määrittelemät merkit ja piste lasketaan sanoihin kuuluviksi, ja välimerkeiksi käyvät &quot;-&quot;, &quot;, &quot;'&quot; ja &quot;:&quot;.

source: aka
fi: eli

source: So every time when Tmispell is invoked with &quot;-d suomi&quot; or &quot;-d /usr/lib/ispell/suomi.hash&quot; as arguments, the Soikko module is used for spell checking. Otherwise the Ispell program is started instead.
fi: Joka kerta siis kun Tmispell käynnistetään valitsimin &quot;-d suomi&quot; tai &quot;-d /usr/lib/ispell/suomi.hash&quot;, niin Soikko-moduuli hoitaa oikoluvun. Muissa tapauksissa tavallinen Ispell käynnistyy.

source: The fifth line specifies that in TeX filter mode the parameters to commands begin{}, end{} and usepackage{} should not be spell checked, whereas the second optional and second obligatory parameters to newcommand should.
fi: Viides rivi määrittelee, että TeX-suodatin estää komentojen begin{}, end{} ja usepackage{} parametrien oikoluvun, muttei komennon newcommand toisen valinnaisen ja pakollisen parametrin oikolukua.

source: The sixth line specifies that in TeX filter mode no math environment should be spell checked.
fi: Kuudes rivi määrittelee, että TeX-tilassa matematiikkaympäristöjä ei oikolueta.

source: SEE ALSO
fi: KATSO MYÖS

source: %1$s, by Pasi Ryhänen.
fi: Pasi Ryhäsen %1$s

source: AUTHOR
fi: TEKIJÄ

source: Tmispell version 0.2.3
fi: Tmispell, versio 0.2.3

source: What Tmispell is?
fi: Mikä Tmispell on?

source: Usage
fi: Käyttö

source: Currently Tmispell has an interactive text-mode user interface that can be used for spell checking text. It can be started by typing %1$s When a misspelled word is encountered, you will be asked what to do. The usage of the interface should fairly obvious, but you can get help about keys by pressing '?'.
fi: Tällä hetkellä Tmispellissä on tekstikäyttöliittymä, jota voi käyttää tekstien oikolukemiseen. Sen voi käynnistää kirjoittamalla %1$s Kun väärin kirjoitettu sana löytyy, kysyy ohjelma mitä tehdä. Käyttöliittymän toiminnan pitäisi olla melko itsestäänselvää, mutta luettelon käytettävistä näppäimistä saa kirjoittamalla &quot;?&quot;.

source: file.txt
fi: tiedosto.txt

source: If you would like to use the filters, put one of the options '%1$s', '%2$s' and '%3$s' (TeX, nroff and Sgml, respectively) in front of the file name to spell check. For more information about options, see the ispell(1) manual page.
fi: Jos haluat käyttää suodattimia, kirjoita yksi valitsimista '%1$s', '%2$s' tai '%3$s' (vastaavat muotoja TeX, nroff ja sgml) oikoluettavan tiedoston nimen eteen. Lisätietoja valitsimista on Ispellin manuaalisivulla ispell(1).

source: Installation
fi: Asennus

source: These instructions tell how to build and install Tmispell from scratch. There are also prebuilt packages, which you likely want to use instead of doing installation the hard way.
fi: Nämä ohjeet kertovat, miten Tmispell käännetään ja asennetaan lähdekoodipaketista. Olemassa on myös valmiita paketteja, joita kannattaa käyttää, jos ei halua tehdä asioita vaikeasti.

source: Compile and install Tmispell:
fi: Tmispellin kääntäminen ja asennus:

source: The %1$s just copies the tmispell executable and manual page to suitable places.
fi: %1$s vain kopioi Tmispell-ohjelman ja manuaalisivun sopiviin paikkoihin.

source: Download and install Soikko (see http://www.iki.fi/~pry/soikko/).
fi: Hae ja asenna Soikko (ks. http://www.iki.fi/~pry/soikko/).

source: Create the configuration file and place it to the place where Tmispell looks for it. There is also an example configuration file %1$s, which should be used as a template. (See &quot;The configuration file format&quot; below.) Check that the path names in spell checker entries point to correct places.
fi: Luo asetustiedosto, ja sijoita se sinne, mistä Tmispell sen löytää. Mallina on esimerkkitiedosto %1$s. (Katso &quot;Asetustiedoston muoto&quot; alempana.) Tarkista, että tiedostojen polut oikolukumoduuliriveillä ovat oikein.

source: To make other programs use Tmispell instead of Ispell, first move aside the original Ispell executable, and then create a link from &quot;tmispell&quot; to &quot;ispell&quot;. For example: %1$s Remember to change the &quot;ispell=...&quot; line in configuration file to point to the real Ispell executable.
fi: Saadaksesi muut ohjelmat käyttämään Tmispelliä Ispellin sijaan, siirrä ensin alkuperäinen Ispell-ohjelmatiedosto syrjään, ja luo linkki &quot;ispell&quot;, joka osoittaa tmispelliin. Esimerkiksi siis: %1$s Muista muuttaa &quot;ispell=...&quot;-rivi asetustiedostossa osoittamaan alkuperäiseen Ispell-ohjelmaan.

source: Other programs must also know that a Finnish spell checking is possible, so run the following command to create fake dictionary files: %1$s Note that the path might also be &quot;/usr/share/ispell&quot; or something similar, depending on your system.
fi: Muiden ohjelmien täytyy tietää, että suomen oikoluku on mahdollista, joten aja seuraava komento luodaksesi tarvittavat &quot;sanastotiedostot&quot;: %1$s Huomaa, että tiedostojen polku voisi olla myös &quot;/usr/share/ispell&quot; tai jotakin vastaavaa järjestelmästäsi riippuen.

source: To check that Tmispell works properly, type the following command: %1$s If you had specified a dictionary with identifier &quot;suomi&quot; in the configuration file, then you should see a line similar to this: %2$s Now you can type words to spell check. For more information about this command mode, refer to the ispell(1) manual.
fi: Tarkistaaksesi, että Tmispell toimii kunnolla, kirjoita seuraava komento: %1$s Jos määrittelit sanaston nimeltä &quot;suomi&quot; asetustiedostossa, niin seuraavanlaisen rivin pitäisi näkyä: %2$s Nyt voit kirjoittaa sanoja oikoluettavaksi. Lisätietoja tästä komentotilasta saa manuaalisivulta ispell(1).

source: Program-specific information
fi: Ohjelmakohtaisia ohjeita

source: Emacs (both Ispell and Flyspell modes)
fi: Emacs (sekä Ispell- että Flyspell-tilat)

source: Note that you might have to add something like the following to your %1$s configuration file, since Ispell support in Emacs does not know about Finnish dictionary by default: %2$s If you like to have Finnish as the default dictionary, add also: %3$s If you still encounter problems (e.g. with TeX files), try turning the multi byte character support of Emacs off.
fi: Huomaa, että usein on pakko lisätä jotakin seuraavankaltaista asetustiedostoon %1$s, sillä Emacsin Ispell-tuki ei oletusarvoisesti tiedä suomen kielen sanastosta: %2$s Jos haluat suomen oletusarvoiseksi sanastoksi, lisää myös rivi %3$s Jos toiminnassa ilmenee ongelmia (esim. TeX-tiedostojen kanssa) yritä Emacsin monitavumerkistöjen tuen ottamista pois käytöstä.

source: Pspell (Sylpheed, Balsa and many more)
fi: Pspell (Sylpheed, Balsa ja monet muut)

source: Although Pspell is being replaced by Aspell, some programs still use it. To use Tmispell with it, you need to have pspell-ispell module for Pspell installed, and a file %1$s with the following line in it: %2$s
fi: Vaikka Pspelliä ollaankin korvaamassa Aspellillä, jotkin ohjelmat käyttävät sitä vielä. Tmispelliä voi käyttää Pspellin kanssa, jos Pspellin pspell-ispell-moduuli on asennettu, ja on olemassa tiedosto %1$s, jossa on seuraava rivi: %2$s

source: Other programs (most KDE applications, LyX, ...)
fi: Muut ohjelmat (useimmat KDE-ohjelmat, LyX, ...)

source: When the fake dictionary files (see Installation) exist, Finnish should appear in the dictionary list in these programs.
fi: Kun &quot;sanastotiedostot&quot; ovat olemassa (katso asennus), suomen pitäisi näkyä yhtenä kielivaihtoehtona näissä ohjelmissa.

source: The configuration file format
fi: Asetustiedoston muoto

source: Known issues
fi: Tunnetut ongelmat

source: Missing features
fi: Puuttuvat ominaisuudet

source: Implement entity encoding and decoding in SGML filter. To do this reasonably, some changes are likely required in filter architecture.
fi: SGML-suodattimen tulisi osata purkaa ja koodata entiteettejä. Jotta tämän voisi tehdä järkevästi, tarvittaneen muutoksia suodatinarkkitehtuuriin.

source: Support for multibyte (UTF-8, UTF-16, etc.) encodings. Might go together with encode decoding etc.
fi: Monitavumerkistöjen (UTF-8, UTF-16, ...) tuki puuttuu. Voisi liittyä entiteettien koodaamiseen ja purkamiseen jne.

source: Other things to do
fi: Muuta tehtävää

source: Investigate how Aspell support could be implemented. Need for a Soikko-patched Aspell?
fi: Mieti, miten Aspell-tuki pitäisi toteuttaa. Onko Soikko-pätsätylle Aspellille tarvetta?

source: Think about Ispell extended characters (whatever they are).
fi: Mieti Ispellin &quot;extended charactereja&quot; (mitä lienevätkään).
